app/Controllers/Auditor.php

    public function dash()
    {
        $user_id = session()->get('id');
        $id_satker = $this->request->getGet('id_satker');
        $thn = $this->request->getGet('thn');
        $precentage = $this->nilaiPKModel->precentage($id_satker, $thn);
        $dash = $this->nilaiPKModel->dashboard($id_satker, $thn);
        $satker = $this->satkerModel->where('id', $id_satker)->first();
---
SELECT *
FROM `satker`
WHERE `id` = '208'
 LIMIT 1