app/Controllers/TataUsaha.php

    public function save()
    {
        $data = $this->request->getPost();
        $existingData = $this->TimauditModel->where('id_satker', $data['satkerId'])
            ->where('tim', $data['tipePenilaian'])
            ->where('YEAR(tgl_surat)', date('Y', strtotime($data['tglSurat'])))
            ->first();
---
SELECT *
FROM `timaudit`
WHERE `id_satker` = '208'
AND `tim` = '1'
AND YEAR(tgl_surat) = '2025'
 LIMIT 1