app/Models/AnggotaTimModel.php

    public function getByID($id)
    {
        $builder = $this->db->table('assign_pk as a');
        $builder->select('a.id_pk, a.id_timaudit, a.id_auditor, a.rolepk, a.id_satker, a.created_date, a.id_tu, a.is_active, b.username, b.firstname');
        $builder->join('users as b', 'a.id_auditor = b.id', 'left');
        $builder->where('a.id_timaudit', $id); // variabel $id berisi id_timaudit yang ingin difilter
        $builder->orderBy('a.rolepk', 'ASC');
        $query = $builder->get();
---
SELECT `a`.`id_pk`, `a`.`id_timaudit`, `a`.`id_auditor`, `a`.`rolepk`, `a`.`id_satker`, `a`.`created_date`, `a`.`id_tu`, `a`.`is_active`, `b`.`username`, `b`.`firstname`
FROM `assign_pk` as `a`
LEFT JOIN `users` as `b` ON `a`.`id_auditor` = `b`.`id`
WHERE `a`.`id_timaudit` = '509'
ORDER BY `a`.`rolepk` ASC