app/Models/DataUmumModel.php

    public function getBySatker($id_satker)
    {
        return $this->where('id_satker', $id_satker)->findAll();
---
SELECT *
FROM `dataumum`
WHERE `id_satker` = '0'