app/Models/NilaiPMModel.php

    public function filter($id_satker, $thn_dipa)
    {
        // Membuat instance query builder untuk tabel 'nilai_pm'
        $builder = $this->db->table('nilai_pm');

        // Pilih kolom yang dibutuhkan
        $builder->select('idx, id_user, id_satker, id_pm_satker, nilai, link_dakung, thn_dipa, date_created');

        // Tambahkan filter WHERE
        $builder->where('id_satker', $id_satker);
        $builder->where('thn_dipa', $thn_dipa);

        // Eksekusi query
        $query = $builder->get();
---
SELECT `idx`, `id_user`, `id_satker`, `id_pm_satker`, `nilai`, `link_dakung`, `thn_dipa`, `date_created`
FROM `nilai_pm`
WHERE `id_satker` = '208'
AND `thn_dipa` = '2024'

    public function dashboard($id_satker, $thn_dipa)
    {
        $subquery1 = $this->db->table('komponen_sub_unsur')
            ->select('id_komponen, id_unsur, id_sub_unsur, id_indikator');

        $subquery2 = $this->db->table('komponen_unsur')
            ->select("id_komponen, id_unsur, '0' AS id_sub_unsur, id_indikator", false); // Literal '0'

        // Menggabungkan dua subquery dengan UNION ALL
        $unionQuery = $subquery1->unionAll($subquery2);

        // Query utama dengan LEFT JOIN
        $builder = $this->db->table("({$unionQuery->getCompiledSelect()}) AS ks")
            ->select('ks.id_komponen, c.nama_komponen, ks.id_unsur, u.nama_unsur,
              ks.id_sub_unsur, su.name_sub_unsur, ks.id_indikator, i.nama_indikator,
              i.bobot_indikator, COALESCE(p_nilai.nilai, 0) AS nilai', false) // Menangani NULL dengan COALESCE
            ->join('indikator AS i', 'ks.id_indikator = i.id_indikator', 'left')
            ->join('komponen AS c', 'ks.id_komponen = c.id_komponen', 'left')
            ->join('sub_unsur AS su', 'ks.id_sub_unsur = su.id_sub_unsur', 'left')
            ->join('unsur AS u', 'ks.id_unsur = u.id_unsur', 'left')
            ->join('nilai_pm AS n_pm', 'ks.id_indikator = n_pm.id_pm_satker AND n_pm.id_satker = ' . $this->db->escape($id_satker) . ' AND n_pm.thn_dipa = ' . $this->db->escape($thn_dipa), 'left', false)
            ->join('pilih_nilai AS p_nilai', 'n_pm.nilai = p_nilai.id', 'left')
            ->orderBy('ks.id_indikator', 'ASC');

        $query = $builder->get();
---
SELECT ks.id_komponen, c.nama_komponen, ks.id_unsur, u.nama_unsur, 
              ks.id_sub_unsur, su.name_sub_unsur, ks.id_indikator, i.nama_indikator, 
              i.bobot_indikator, COALESCE(p_nilai.nilai, 0) AS nilai
FROM ((SELECT * FROM (SELECT `id_komponen`, `id_unsur`, `id_sub_unsur`, `id_indikator`
FROM `komponen_sub_unsur`) `uwrp0`
UNION ALL SELECT * FROM (SELECT id_komponen, `id_unsur`, '0' AS id_sub_unsur, id_indikator FROM `komponen_unsur`) `uwrp1`) AS ks)
LEFT JOIN `indikator` AS `i` ON `ks`.`id_indikator` = `i`.`id_indikator`
LEFT JOIN `komponen` AS `c` ON `ks`.`id_komponen` = `c`.`id_komponen`
LEFT JOIN `sub_unsur` AS `su` ON `ks`.`id_sub_unsur` = `su`.`id_sub_unsur`
LEFT JOIN `unsur` AS `u` ON `ks`.`id_unsur` = `u`.`id_unsur`
LEFT JOIN nilai_pm AS n_pm ON ks.id_indikator = n_pm.id_pm_satker AND n_pm.id_satker = '208' AND n_pm.thn_dipa = '2024'
LEFT JOIN `pilih_nilai` AS `p_nilai` ON `n_pm`.`nilai` = `p_nilai`.`id`
ORDER BY `ks`.`id_indikator` ASC