app/Models/NilailvlModel.php

SELECT `idx`, `id_user`, `id_satker`, `id_pm_satker`, `nilai`, `komenlvl`, `rekomendasi`, `thn_dipa`, `date_created`
FROM `nilai_level`
WHERE `id_satker` = '208'
AND `thn_dipa` = '2024'
---
    public function filter($id_satker, $thn_dipa)
    {
        // Membuat instance query builder untuk tabel 'nilai_pm'
        $builder = $this->db->table('nilai_level');

        // Pilih kolom yang dibutuhkan
        $builder->select('idx, id_user, id_satker, id_pm_satker, nilai, komenlvl, rekomendasi, thn_dipa, date_created');

        // Tambahkan filter WHERE
        $builder->where('id_satker', $id_satker);
        $builder->where('thn_dipa', $thn_dipa);

        // Eksekusi query
        $query = $builder->get();