app/Models/PertanyaanModel.php

SELECT `ks`.`id_komponen`, `c`.`nama_komponen`, `ks`.`id_unsur`, `u`.`nama_unsur`, `ks`.`id_sub_unsur`, `su`.`name_sub_unsur`, `ks`.`id_indikator`, `i`.`nama_indikator`
FROM ((SELECT * FROM (SELECT `id_komponen`, `id_unsur`, `id_sub_unsur`, `id_indikator`
FROM `komponen_sub_unsur`) `uwrp0`
UNION ALL SELECT * FROM (SELECT id_komponen, `id_unsur`, '0' AS id_sub_unsur, id_indikator FROM `komponen_unsur`) `uwrp1`) AS ks)
LEFT JOIN `indikator` AS `i` ON `ks`.`id_indikator` = `i`.`id_indikator`
LEFT JOIN `komponen` AS `c` ON `ks`.`id_komponen` = `c`.`id_komponen`
LEFT JOIN `sub_unsur` AS `su` ON `ks`.`id_sub_unsur` = `su`.`id_sub_unsur`
LEFT JOIN `unsur` AS `u` ON `ks`.`id_unsur` = `u`.`id_unsur`
---
    public function soal()
    {
        // Subquery pertama: Dari tabel komponen_sub_unsur
        $subquery1 = $this->db->table('komponen_sub_unsur')
            ->select('id_komponen, id_unsur, id_sub_unsur, id_indikator');

        // Subquery kedua: Dari tabel komponen_unsur
        $subquery2 = $this->db->table('komponen_unsur')
            ->select("id_komponen, id_unsur, '0' AS id_sub_unsur, id_indikator", false); // Literal '0'

        // Gabungkan kedua subquery menggunakan UNION
        $unionQuery = $subquery1->unionAll($subquery2);

        // Query utama: LEFT JOIN dengan tabel indikator, komponen, sub_unsur, dan unsur
        $builder = $this->db->table("({$unionQuery->getCompiledSelect()}) AS ks")
            ->select('ks.id_komponen, c.nama_komponen, ks.id_unsur,  u.nama_unsur, ks.id_sub_unsur, su.name_sub_unsur, ks.id_indikator, i.nama_indikator ')
            ->join('indikator AS i', 'ks.id_indikator = i.id_indikator', 'left')
            ->join('komponen AS c', 'ks.id_komponen = c.id_komponen', 'left')
            ->join('sub_unsur AS su', 'ks.id_sub_unsur = su.id_sub_unsur', 'left')
            ->join('unsur AS u', 'ks.id_unsur = u.id_unsur', 'left');

        // Eksekusi query
        $query = $builder->get();