app/Models/PimPKModel.php

    public function filter($id_satker, $thn_dipa)
    {
        $builder = $this->db->table('status_kpk');
        $builder->select('*');
        $builder->where('id_satker', $id_satker);
        $builder->where('thn_dipa', $thn_dipa);
        $query = $builder->get();
---
SELECT *
FROM `status_kpk`
WHERE `id_satker` = '208'
AND `thn_dipa` = '2025'