app/Models/PKModel.php

SELECT *
FROM `status_pk`
WHERE `id_satker` = '208'
AND `thn_dipa` = '2025'
---
    public function filter($id_satker, $thn_dipa)
    {
        $builder = $this->db->table('status_pk');
        $builder->select('*');
        $builder->where('id_satker', $id_satker);
        $builder->where('thn_dipa', $thn_dipa);
        $query = $builder->get();