app/Models/SatkerModel.php

    public function getSatkerByPembina($pembina)
    {
        return $this->where('pembina', $pembina)
            ->findAll();
---
SELECT *
FROM `satker`
WHERE `pembina` = 'IR1'