app/Models/SPimPMModel.php

SELECT *
FROM `status_pim`
WHERE `id_satker` = '208'
AND `thn_dipa` = '2024'
---
    public function filter($id_satker, $thn_dipa)
    {
        $builder = $this->db->table('status_pim');
        $builder->select('*');
        $builder->where('id_satker', $id_satker);
        $builder->where('thn_dipa', $thn_dipa);
        $query = $builder->get();