app/Models/TimauditModel.php

    public function getByIR($ir)
    {
        $builder = $this->db->table('timaudit as a');
        $builder->select('a.id_timaudit, b.nama_satker, b.nama_organisasi, a.tgl_surat, a.tim, a.statustim');
        $builder->join('satker as b', 'a.id_satker = b.id', 'left');
        $builder->where('b.pembina', $ir);
        $builder->orderBy('a.tgl_surat', 'DESC');
        $query = $builder->get();
---
SELECT `a`.`id_timaudit`, `b`.`nama_satker`, `b`.`nama_organisasi`, `a`.`tgl_surat`, `a`.`tim`, `a`.`statustim`
FROM `timaudit` as `a`
LEFT JOIN `satker` as `b` ON `a`.`id_satker` = `b`.`id`
WHERE `b`.`pembina` = 'IR1'
ORDER BY `a`.`tgl_surat` DESC

    public function getByID($id)
    {
        $builder = $this->db->table('timaudit as a');
        $builder->select('a.id_timaudit, a.nosurat,a.id_satker, b.nama_satker, a.tgl_awal, a.tgl_akhir, a.tgl_surat, a.tim, a.statustim');
        $builder->join('satker as b', 'a.id_satker = b.id', 'left');
        $builder->where('a.id_timaudit', $id);
        $builder->orderBy('a.tgl_surat', 'DESC');
        $query = $builder->get();
---
SELECT `a`.`id_timaudit`, `a`.`nosurat`, `a`.`id_satker`, `b`.`nama_satker`, `a`.`tgl_awal`, `a`.`tgl_akhir`, `a`.`tgl_surat`, `a`.`tim`, `a`.`statustim`
FROM `timaudit` as `a`
LEFT JOIN `satker` as `b` ON `a`.`id_satker` = `b`.`id`
WHERE `a`.`id_timaudit` = '509'
ORDER BY `a`.`tgl_surat` DESC