app/Models/UserModel.php

SELECT `u`.`id`, `u`.`username`, `u`.`firstname`, `u`.`lastname`, `u`.`email`, `u`.`id_satker`, `s`.`nama_satker`, `s`.`nama_organisasi`, `s`.`pembina`
FROM `users` AS `u`
LEFT JOIN `satker` AS `s` ON `u`.`id_satker` = `s`.`id`
WHERE `u`.`id` = '269'
---
    public function getSatker($id)
    {
        $builder = $this->db->table('users AS u')
            ->select('u.id, u.username, u.firstname, u.lastname, u.email, u.id_satker, s.nama_satker, s.nama_organisasi, s.pembina')
            ->join('satker AS s', 'u.id_satker = s.id', 'left')
            ->where('u.id', $id);

        $query = $builder->get();

SELECT *
FROM `users`
WHERE `role` = '6'
---
    public function getInspektur()
    {
        return $this->where('role', '6')
            ->findAll();

SELECT *
FROM `users`
WHERE `role` = '5'
---
    public function getAuditor()
    {
        return $this->where('role', '5')
            ->findAll();